---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DirectContext3DService
source: html/eb119187-a1f9-0f3f-0e75-8338d8a48cce.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DirectContext3DService Property

The external service that provides the facility to draw externally specified geometry in a Revit view in a way that is conceptually similar to a low-level graphics API.
 To use this service, programmers implement a server class that derives from Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer.

## Syntax (C#)
```csharp
public static ExternalServiceId DirectContext3DService { get; }
```